{
  "architectures": [
    "SpanMarkerModel"
  ],
  "encoder": {
    "_name_or_path": "google/bert_uncased_L-2_H-128_A-2",
    "add_cross_attention": false,
    "architectures": null,
    "attention_probs_dropout_prob": 0.1,
    "bad_words_ids": null,
    "begin_suppress_tokens": null,
    "bos_token_id": null,
    "chunk_size_feed_forward": 0,
    "classifier_dropout": null,
    "cross_attention_hidden_size": null,
    "decoder_start_token_id": null,
    "diversity_penalty": 0.0,
    "do_sample": false,
    "early_stopping": false,
    "encoder_no_repeat_ngram_size": 0,
    "eos_token_id": null,
    "exponential_decay_length_penalty": null,
    "finetuning_task": null,
    "forced_bos_token_id": null,
    "forced_eos_token_id": null,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.1,
    "hidden_size": 128,
    "id2label": {
      "0": "L-body.headers.row",
      "1": "B-footer.text",
      "2": "L-body.content",
      "3": "B-body.headers.row",
      "4": "U-body.content",
      "5": "L-body.headers.col",
      "6": "I-body.headers.col",
      "7": "B-body.content",
      "8": "I-body.headers.row",
      "9": "B-header.text",
      "10": "O",
      "11": "I-header.text",
      "12": "U-header.table_id",
      "13": "I-footer.text",
      "14": "L-header.text",
      "15": "B-body.headers.col",
      "16": "L-footer.text"
    },
    "initializer_range": 0.02,
    "intermediate_size": 512,
    "is_decoder": false,
    "is_encoder_decoder": false,
    "label2id": {
      "B-body.content": 7,
      "B-body.headers.col": 15,
      "B-body.headers.row": 3,
      "B-footer.text": 1,
      "B-header.text": 9,
      "I-body.headers.col": 6,
      "I-body.headers.row": 8,
      "I-footer.text": 13,
      "I-header.text": 11,
      "L-body.content": 2,
      "L-body.headers.col": 5,
      "L-body.headers.row": 0,
      "L-footer.text": 16,
      "L-header.text": 14,
      "O": 10,
      "U-body.content": 4,
      "U-header.table_id": 12
    },
    "layer_norm_eps": 1e-12,
    "length_penalty": 1.0,
    "max_length": 20,
    "max_position_embeddings": 512,
    "min_length": 0,
    "model_type": "bert",
    "no_repeat_ngram_size": 0,
    "num_attention_heads": 2,
    "num_beam_groups": 1,
    "num_beams": 1,
    "num_hidden_layers": 2,
    "num_return_sequences": 1,
    "output_attentions": false,
    "output_hidden_states": false,
    "output_scores": false,
    "pad_token_id": 0,
    "position_embedding_type": "absolute",
    "prefix": null,
    "problem_type": null,
    "pruned_heads": {},
    "remove_invalid_values": false,
    "repetition_penalty": 1.0,
    "return_dict": true,
    "return_dict_in_generate": false,
    "sep_token_id": null,
    "suppress_tokens": null,
    "task_specific_params": null,
    "temperature": 1.0,
    "tf_legacy_loss": false,
    "tie_encoder_decoder": false,
    "tie_word_embeddings": true,
    "tokenizer_class": null,
    "top_k": 50,
    "top_p": 1.0,
    "torch_dtype": null,
    "torchscript": false,
    "transformers_version": "4.35.2",
    "type_vocab_size": 2,
    "typical_p": 1.0,
    "use_bfloat16": false,
    "use_cache": true,
    "vocab_size": 30528
  },
  "entity_max_length": 100,
  "id2label": {
    "0": "O",
    "1": "body.content",
    "2": "body.headers.col",
    "3": "body.headers.row",
    "4": "footer.text",
    "5": "header.table_id",
    "6": "header.text"
  },
  "id2reduced_id": {
    "0": 3,
    "1": 4,
    "2": 1,
    "3": 3,
    "4": 1,
    "5": 2,
    "6": 2,
    "7": 1,
    "8": 3,
    "9": 6,
    "10": 0,
    "11": 6,
    "12": 5,
    "13": 4,
    "14": 6,
    "15": 2,
    "16": 4
  },
  "label2id": {
    "O": 0,
    "body.content": 1,
    "body.headers.col": 2,
    "body.headers.row": 3,
    "footer.text": 4,
    "header.table_id": 5,
    "header.text": 6
  },
  "marker_max_length": 128,
  "max_next_context": null,
  "max_prev_context": null,
  "model_max_length": 512,
  "model_max_length_default": 512,
  "model_type": "span-marker",
  "span_marker_version": "1.5.0",
  "torch_dtype": "float32",
  "trained_with_document_context": false,
  "transformers_version": "4.35.2",
  "vocab_size": 30528
}
